import time

now_time = time.strftime('%Y%m%d%H%M%S', time.localtime())
print(now_time)
# 消息头
消息头起始符 = '['
设备号 = '867082058798193'.zfill(15)
分隔符 = ','
ICCID = '89860000192027575560'.zfill(20)
交易流水号 = f'{now_time}0000'
登录接口 = 'DEVICE_LOGIN'
心跳接口 = "REPORT_HEARTBEAT"
报文类型 = '3'  # 平台下发请求标示 1，则终 端响应标示为 2，终端上报接口标 示为 3，平台响应标示为 4
时间 = f'{now_time}'
登录报文长度 = '22'
心跳报文长度 = '25'
登录报文体 = '5@1@1@1@1@0@0'
心跳报文体 = '97%@0'
# 消息体（请求报文体）


结束标识符 = ']'
data = 消息头起始符 + 设备号 + 分隔符 + ICCID + 分隔符 + 交易流水号 + 分隔符 + 心跳接口 + 报文类型 + 分隔符 + 时间 + 分隔符 + 登录报文长度 + 分隔符 + 登录报文体 + 结束标识符
str1 = f"[{设备号},{ICCID},202308041624300007,REPORT_LOCATION_INFO,3,20230804162430,191," \
       "2E0.000000N0.000000T20230804162430@460!0!30589!218936329@" \
       "460!0!9231!2351@" \
       "wifi!58:41:20:FD:1C:CD!-73#" \
       "wifi!E2:ED:90:6F:FE:22!-74#" \
       "wifi!A8:3B:5C:5B:39:BC!-80#" \
       "wifi!C0:E3:FB:8B:19:73!-87#" \
       "wifi!C0:E3:FB:8B:19:70!-87]"
print(str1)
